output-29b1c4e1-cpupinning/ycsbVMs_ycsb_16vms_bridge_-1rps_rep1/vm5.log
/nix/store/2vwkssqpzykk37r996cafq7x63imf4sp-openjdk-21+35/bin/java  -classpath /nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/conf:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/core-0.17.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/HdrHistogram-2.1.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/htrace-core4-4.1.0-incubating.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-core-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-mapper-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/commons-pool2-2.4.2.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/jedis-2.9.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6379 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
Command line: -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6379 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
YCSB Client 0.17.0

Loading workload...
Starting test.
Maximum execution time specified as: 61 secs
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2024-07-07 16:05:49:136 0 sec: 0 operations; est completion in 0 second 
2024-07-07 16:05:58:966 10 sec: 32985 operations; 3298.5 current ops/sec; est completion in 1 day 12 hours [READ: Count=16467, Max=50623, Min=100, Avg=291.52, 90=400, 99=2377, 99.9=4715, 99.99=10095] [UPDATE: Count=16535, Max=11703, Min=101, Avg=290.22, 90=401, 99=2641, 99.9=5175, 99.99=8335] 
2024-07-07 16:06:08:967 20 sec: 73207 operations; 4022.2 current ops/sec; est completion in 1 day 8 hours [READ: Count=20139, Max=4069, Min=106, Avg=245.88, 90=385, 99=610, 99.9=1239, 99.99=3681] [UPDATE: Count=20066, Max=8343, Min=105, Avg=243.06, 90=380, 99=598, 99.9=1471, 99.99=3937] 
2024-07-07 16:06:18:966 30 sec: 118037 operations; 4483 current ops/sec; est completion in 1 day 6 hours [READ: Count=22408, Max=3517, Min=106, Avg=221.73, 90=354, 99=465, 99.9=619, 99.99=2709] [UPDATE: Count=22422, Max=16559, Min=107, Avg=220, 90=353, 99=461, 99.9=630, 99.99=3313] 
2024-07-07 16:06:28:966 40 sec: 162846 operations; 4480.9 current ops/sec; est completion in 1 day 5 hours [READ: Count=22436, Max=923, Min=114, Avg=221.8, 90=360, 99=456, 99.9=604, 99.99=840] [UPDATE: Count=22373, Max=4235, Min=109, Avg=220.57, 90=358, 99=458, 99.9=614, 99.99=921] 
2024-07-07 16:06:38:966 50 sec: 202693 operations; 3984.7 current ops/sec; est completion in 1 day 5 hours [READ: Count=19974, Max=5087, Min=108, Avg=249.15, 90=397, 99=604, 99.9=841, 99.99=1155] [UPDATE: Count=19873, Max=1169, Min=98, Avg=248.29, 90=395, 99=608, 99.9=846, 99.99=1091] 
2024-07-07 16:06:48:966 60 sec: 246652 operations; 4395.9 current ops/sec; est completion in 1 day 5 hours [READ: Count=21704, Max=13175, Min=111, Avg=227.15, 90=357, 99=492, 99.9=776, 99.99=3471] [UPDATE: Count=22255, Max=3671, Min=108, Avg=223.77, 90=355, 99=494, 99.9=795, 99.99=2631] 
Maximum time elapsed. Requesting stop for the workload.
Stop requested for workload. Now Joining!
2024-07-07 16:06:49:975 61 sec: 250332 operations; 3647.18 current ops/sec; est completion in 1 day 5 hours [READ: Count=1889, Max=14031, Min=127, Avg=276.27, 90=389, 99=711, 99.9=3051, 99.99=14031] [CLEANUP: Count=1, Max=2457, Min=2456, Avg=2457, 90=2457, 99=2457, 99.9=2457, 99.99=2457] [UPDATE: Count=1791, Max=3657, Min=119, Avg=264.73, 90=387, 99=701, 99.9=1737, 99.99=3657] 
[OVERALL], RunTime(ms), 61026
[OVERALL], Throughput(ops/sec), 4102.054861862157
[TOTAL_GCS_Copy], Count, 23
[TOTAL_GC_TIME_Copy], Time(ms), 31
[TOTAL_GC_TIME_%_Copy], Time(%), 0.050798020515845706
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 23
[TOTAL_GC_TIME], Time(ms), 31
[TOTAL_GC_TIME_%], Time(%), 0.050798020515845706
[READ], Operations, 125017
[READ], AverageLatency(us), 240.97201180639433
[READ], MinLatency(us), 100
[READ], MaxLatency(us), 50623
[READ], 95thPercentileLatency(us), 417
[READ], 99thPercentileLatency(us), 575
[READ], Return=OK, 125017
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2457.0
[CLEANUP], MinLatency(us), 2456
[CLEANUP], MaxLatency(us), 2457
[CLEANUP], 95thPercentileLatency(us), 2457
[CLEANUP], 99thPercentileLatency(us), 2457
[UPDATE], Operations, 125315
[UPDATE], AverageLatency(us), 238.8528268762718
[UPDATE], MinLatency(us), 98
[UPDATE], MaxLatency(us), 16559
[UPDATE], 95thPercentileLatency(us), 416
[UPDATE], 99thPercentileLatency(us), 575
[UPDATE], Return=OK, 125315
AUTOTEST_DONE